INSERT INTO CoachSpecification (specification_name) VALUES
    ('главный'),
    ('тренер вратарей'),
    ('тренер по игре в обороне'),
    ('тренер по игре в атаке'),
    ('тренер стандартных положений'),
    ('тренер по физ. подготовке'),
    ('ассистент');

INSERT INTO StaffSpecification (spec_type) VALUES
    ('уборщик'),
    ('охранник'),
    ('газонокосильщик'),
    ('врач'),
    ('директор'),
    ('президент');

INSERT INTO PlayerStatus (status_type, start_date, expiration_date) VALUES
    ('на контракте', '2023-07-01', '2026-06-30'),
    ('на контракте', '2022-01-01', '2025-12-31'),
    ('на контракте', '2024-01-15', '2027-06-30'),
    ('в аренде', '2024-07-01', '2025-06-30'),
    ('в аренде', '2023-08-15', '2024-06-30'),
    ('на контракте', '2021-06-01', '2025-06-30');
