INSERT INTO Club (club_name, creation_date, website) VALUES
    ('Зенит', '1925-05-25', 'https://fc-zenit.ru'),
    ('Спартак', '1922-04-18', 'https://spartak.com'),
    ('ЦСКА', '1911-08-27', 'https://pfc-cska.com'),
    ('Динамо Москва', '1923-04-18', 'https://fcdm.ru'),
    ('Локомотив', '1922-07-23', 'https://fclm.ru'),
    ('Краснодар', '2008-02-22', 'https://fckrasnodar.ru'),
    ('Ростов', '1930-05-10', 'https://www.fc-rostov.ru'),
    ('Ахмат', '1958-06-12', 'https://fc-akhmat.ru');

INSERT INTO Stadium (capacity, stadium_location, build_date) VALUES
    (64468, 'Санкт-Петербург, Футбольная аллея, 1', '2017-03-13'), -- Газпром Арена
    (45360, 'Москва, Волгоградский проспект, 69к2', '2014-09-05'), -- Открытие Банк Арена (Спартак)
    (30057, 'Москва, Песчаная улица, владение 3', '2016-09-10'), -- ВЭБ Арена (ЦСКА)
    (26800, 'Москва, Ленинградский проспект, 36', '2008-11-22'), -- ВТБ Арена (Динамо)
    (27220, 'Москва, Большая Черкизовская улица, 125', '2002-07-05'), -- РЖД Арена (Локомотив)
    (35179, 'Краснодар, ул. Разведчика Леонова, 1', '2016-10-09'), -- Краснодар
    (45000, 'Ростов-на-Дону, ул. Левобережная, 2в', '2018-01-15'), -- Ростов Арена
    (30600, 'Грозный, ул. имени Героя России Сулимана Ахмадова', '2011-05-11'); -- Ахмат Арена

INSERT INTO Stadium_Club (club_id, stadium_id) VALUES
    (1, 1), -- Зенит -> Газпром Арена
    (2, 2), -- Спартак -> Открытие Банк Арена
    (3, 3), -- ЦСКА -> ВЭБ Арена
    (4, 4), -- Динамо -> ВТБ Арена
    (5, 5), -- Локомотив -> РЖД Арена
    (6, 6), -- Краснодар -> Краснодар
    (7, 7), -- Ростов -> Ростов Арена
    (8, 8); -- Ахмат -> Ахмат Арена

INSERT INTO Team (team_name, budget, club_id) VALUES
    ('Зенит', 5500000000.00, 1),
    ('Зенит-2', 500000000.00, 1),
    ('Спартак', 4500000000.00, 2),
    ('Спартак-2', 400000000.00, 2),
    ('ЦСКА', 3500000000.00, 3),
    ('ЦСКА-2', 350000000.00, 3),
    ('Динамо', 3000000000.00, 4),
    ('Краснодар', 4000000000.00, 6),
    ('Ростов', 1500000000.00, 7),
    ('Ахмат', 1200000000.00, 8);