INSERT INTO Player (player_name, player_surname, player_number, salary, phone, birth_date, team_id, status_id) VALUES
-- Зенит
('Андрей', 'Мостовой', 17, 5000000.00, '+79111234567', '1997-11-05', 1, 1),
('Максим', 'Глушенков', 10, 4500000.00, '+79117654321', '1999-07-28', 1, 1),
('Густаво', 'Мантуан', 31, 3500000.00, '+79112345678', '2001-06-20', 1, 1),
('Евгений', 'Латышонок', 1, 800000.00, '+79115556677', '1998-06-21', 1, 3),
-- Спартак
('Антон', 'Заболотный', 91, 2500000.00, '+79211234567', '1991-06-13', 3, 2),
('Пабло', 'Солари', 7, 4000000.00, '+79217654321', '2001-03-22', 3, 2),
('Срджан', 'Бабич', 6, 2000000.00, '+79212345678', '1996-04-22', 3, 6),
-- ЦСКА
('Даниил', 'Круговой', 3, 2000000.00, '+79311234567', '1998-05-28', 5, 2),
('Игорь', 'Акинфеев', 35, 3000000.00, '+79317654321', '1986-04-08', 5, 6),
('Матвей', 'Кисляк', 6, 1500000.00, '+79312345678', '2005-07-26', 5, 5),
-- Динамо
('Николас', 'Маричаль', 2, 2200000.00, '+79411234567', '2001-03-17', 7, 1),
('Антон', 'Миранчук', 21, 1800000.00, '+79417654321', '1995-10-17', 7, 4),
-- Краснодар
('Эдуард', 'Сперцян', 10, 2000000.00, '+79511234567', '2000-06-07', 8, 3),
('Александр', 'Черников', 53, 1200000.00, '+79517654321', '2000-02-01', 8, 3);

INSERT INTO Coach (coach_name, coach_surname, salary, phone, team_id) VALUES
-- Тренеры Зенита
('Сергей', 'Семак', 7000000.00, '+79119998877', 1),
('Михаил', 'Бирюков', 2000000.00, '+79118887766', 1),
('Анатолий', 'Тимощук', 1800000.00, '+79117776655', 1),
-- Тренеры Спартака
('Гильермо', 'Абаскаль', 5000000.00, '+79219998877', 3),
('Дмитрий', 'Гончаров', 1500000.00, '+79218887766', 3),
-- Тренер ЦСКА
('Фабио', 'Челестини', 4500000.00, '+79319998877', 5),
-- Тренер Динамо
('Валерий', 'Карпин', 4000000.00, '+79419998877', 7);

INSERT INTO Coach_Specification (specification_id, coach_id) VALUES
-- Сергей Семак (Зенит) - главный
(1, 1),
-- Михаил Бирюков (Зенит) - тренер вратарей
(2, 2),
-- Анатолий Тимощук (Зенит) - тренер по обороне
(3, 3),
-- Гильермо Абаскаль (Спартак) - главный
(1, 4),
-- Дмитрий Гончаров (Спартак) - ассистент
(7, 5),
-- Фабио Челестини (ЦСКА) - главный
(1, 6),
-- Валерий Карпин (Динамо) - главный
(1, 7);

INSERT INTO Staff (staff_name, staff_surname, salary, specification_id, club_id) VALUES
-- Персонал Зенита
('Агилъ', 'Эмировъ', 30000.00, 1, 1), -- уборщик
('Алексей', 'Каренин', 90000.00, 4, 1), -- врач
('Александр', 'Медведев', 1500000.00, 6, 1), -- президент
-- Персонал Спартака
('Александр', 'Брейман', 65000.00, 2, 2), -- охранник
('Олег', 'Романов', 120000.00, 4, 2), -- врач
-- Персонал ЦСКА
('Алексей', 'Вронский', 80000.00, 3, 3), -- газонокосильщик
('Евгений', 'Гинер', 2000000.00, 6, 3); -- президент